
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 5 to change, 13 to destroy.</code></pre>

* Update
  * module.ams_product[0].azurerm_api_management_product.product
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.dg_recovery[0]
  * azurerm_key_vault_secret.dg_recovery[1]
* Replace
  * azurerm_virtual_machine_extension.aad[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * module.data_gateway_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.data_gateway_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.data_gateway_vm[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
  * module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.dg_recovery[0] will be destroyed
  # (because azurerm_key_vault_secret.dg_recovery is not in configuration)
  - resource "azurerm_key_vault_secret" "dg_recovery" {
      - content_type            = "" -> null
      - id                      = "https://pre-sbox.vault.azure.net/secrets/dg1-recovery-key/98a81170bddb4d4cb8d1ab27a9e92248" -> null
      - key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox" -> null
      - name                    = "dg1-recovery-key" -> null
      - resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox/secrets/dg1-recovery-key/versions/98a81170bddb4d4cb8d1ab27a9e92248" -> null
      - resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox/secrets/dg1-recovery-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "98a81170bddb4d4cb8d1ab27a9e92248" -> null
      - versionless_id          = "https://pre-sbox.vault.azure.net/secrets/dg1-recovery-key" -> null
    }

  # azurerm_key_vault_secret.dg_recovery[1] will be destroyed
  # (because azurerm_key_vault_secret.dg_recovery is not in configuration)
  - resource "azurerm_key_vault_secret" "dg_recovery" {
      - content_type            = "" -> null
      - id                      = "https://pre-sbox.vault.azure.net/secrets/dg2-recovery-key/7ac6eeae720946e8b5e453a521da46c3" -> null
      - key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox" -> null
      - name                    = "dg2-recovery-key" -> null
      - resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox/secrets/dg2-recovery-key/versions/7ac6eeae720946e8b5e453a521da46c3" -> null
      - resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox/secrets/dg2-recovery-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "7ac6eeae720946e8b5e453a521da46c3" -> null
      - versionless_id          = "https://pre-sbox.vault.azure.net/secrets/dg2-recovery-key" -> null
    }

  # azurerm_virtual_machine_extension.aad[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "aad" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox/extensions/AADLoginForWindows" -> (known after apply)
        name                        = "AADLoginForWindows"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.edit_init[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "edit_init" {
      - auto_upgrade_minor_version  = false -> null
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox/extensions/toolingScript" -> (known after apply)
        name                        = "toolingScript"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ams_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/products/pre-ams-integration"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.data_gateway_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm1-sbox/dataDisks/data-gateway-vm01-data-sbox" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm1-sbox" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.data_gateway_vm[0].azurerm_virtual_machine_extension.vmextension[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "vmextension" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm1-sbox/extensions/azure-disk-encrypt-c0hq" -> (known after apply)
        name                        = "azure-disk-encrypt-c0hq"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm1-sbox" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      - custom_data                   = (sensitive value) # forces replacement
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      ~ id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm1-sbox" -> (known after apply)
      - license_type                  = "" -> null
        name                          = "dg-vm1-sbox"
      ~ private_ip_address            = "10.48.1.222" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.48.1.222",
        ] -> (known after apply)
      - proximity_placement_group_id  = "" -> null
      ~ public_ip_address             = "" -> (known after apply)
      ~ public_ip_addresses           = [] -> (known after apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "a69c7a5e-2514-412c-b9b5-f48ac2eda413" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (18 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "dg-vm1-sbox_OsDisk_1_97c0fd131d83486687a33b9f451c68d4" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.data_gateway_vm[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm2-sbox/dataDisks/data-gateway-vm02-data-sbox" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm2-sbox" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.data_gateway_vm[1].azurerm_virtual_machine_extension.vmextension[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "vmextension" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm2-sbox/extensions/azure-disk-encrypt-Mj6Y" -> (known after apply)
        name                        = "azure-disk-encrypt-Mj6Y"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm2-sbox" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      - custom_data                   = (sensitive value) # forces replacement
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      ~ id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/dg-vm2-sbox" -> (known after apply)
      - license_type                  = "" -> null
        name                          = "dg-vm2-sbox"
      ~ private_ip_address            = "10.48.1.223" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.48.1.223",
        ] -> (known after apply)
      - proximity_placement_group_id  = "" -> null
      ~ public_ip_address             = "" -> (known after apply)
      ~ public_ip_addresses           = [] -> (known after apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "ff0fb6a9-4ba8-484e-abff-fb8beae25532" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (18 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "dg-vm2-sbox_OsDisk_1_a0a341ee63424e6291accd09c4c27b9c" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox/dataDisks/edit-vm01-data-sbox" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_virtual_machine_extension.vmextension[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "vmextension" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox/extensions/azure-disk-encrypt-whXs" -> (known after apply)
        name                        = "azure-disk-encrypt-whXs"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      ~ custom_data                   = (sensitive value) # forces replacement
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - encryption_at_host_enabled    = false -> null
      - eviction_policy               = "" -> null
      ~ id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox" -> (known after apply)
      - license_type                  = "" -> null
        name                          = "edit-vm1-sbox"
      ~ private_ip_address            = "10.48.1.6" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.48.1.6",
        ] -> (known after apply)
      - proximity_placement_group_id  = "" -> null
      ~ public_ip_address             = "" -> (known after apply)
      ~ public_ip_addresses           = [] -> (known after apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "72dd7866-f629-485f-813f-456696c39b85" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (18 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "edit-vm1-sbox_OsDisk_1_a733a5905e114c799fd5717db10504c5" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupsbox"
        name                              = "preingestsabackupsbox"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (37 unchanged attributes hidden)

      ~ immutability_policy {
          ~ period_since_creation_in_days = 7 -> 1
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox/objectId/5356a0e7-324e-4efa-970b-4b4aec3f0ba3"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          - "SetRotationPolicy",
          - "GetRotationPolicy",
          - "Rotate",
        ]
        # (6 unchanged attributes hidden)

      - timeouts {}
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            "List",
          - "Get",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.KeyVault/vaults/pre-sbox|pre-sbox"
        name                       = "pre-sbox"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 11 to add, 5 to change, 13 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":555,"Program":"tfcmt","SHA1":"","Vars":{}} -->